"""

파이썬으로 할 수 있는 것들

- 시스템 유틸리티 제작
    - 파이썬은 운영체제의 시스템 명령어를 이용할 수 있다.
    - 이를 바탕으로 시스템 유틸리티 제작이 가능하다.
    
- GUI 프로그래밍
    - Tkinter를 사용해 GUI 프로그램을 만들 수 있다.

- C/C++와의 결합
    - 파이썬을 접착(glue) 언어라고도 부른다.
    - 다른 언어와의 결합도가 높다.
    - C/C++로 만든 프로그램을 파이썬에서 사용할 수 있으면 그 반대도 가능하다.

- 웹 프로그래밍
    - 웨 프로그램 제작이 가능하다.

- 수치 연산 프로그래밍
    - 파이썬 자체는 수치 연산에 적합하지 않다.
    - 하지만 C로 제작한 Numeric Python을 사용하면 빠른 수치 연산이 가능하다.

- 데이터베이스 프로그래밍
    - 각종 데이터베이스와의 연동을 지원한다.
    - 피클(pickle)이라는 모듈을 사용한 데이터 관리도 지원한다.

- 데이터 분석, 사물인터넷
    - 판다스(Pandas) 모듈을 사용해 데이터 분석을 한다.
    - 라즈베리파이를 제어한다.



파이썬으로 할 수 없는 것들

- 시스템과 밀접한 프로그래밍
    - 높은 횟수의 반복과 연산을 필요로 하는 프로그램은 적합하지 않다.
    - 데이터 압축 알고리즘 개발 등에도 적합하지 않다.
    - 즉 빠른 속도와 H/W를 직접 건드리는 프로그램에는 적합하지 않다.

- 모바일 프로그래밍
    - 앱 개발은 아직 부족하다.
    

"""